Hi @MaxxLiu22 

thank you for looking into this.
I will attach Outputs at the end.

1. On a Fortigate 61F I want to configure Port4, which is called "internal4", with clean default config. `Step-1`
2. Run `terragrunt run-all apply`, which uses Terraform v1.11.1, to configure IP Address, Allowaccess and Description. `Step-2`
3. Port internal4 configured. `Step-3`
4. `terragrunt run-all destroy` to delete interface config. `Step-4`
5. Port internal4 is still configured on the firewall. Like `Step-3` unchanged.
6. Terraform destroyed its references in the state. After `terragrunt run-all apply` to add the interface back to state, I want to change the configuration to use another interface internal5. `terragrunt run-all plan` shows a replace with 1 addition and 1 destruction. `Step-6`
7. `terragrunt run-all apply` fails because internal4 configuration was not cleared properly. `Step-7`
8. On Fortigate CLI I can just unset the values to return to default config. `Step-8`

### Step-1

```
cph-fw-01 # show system interface internal4
config system interface
    edit "internal4"
        set vdom "root"
        set type physical
        set snmp-index 11
    next
end
```


### Step-2
```
$ terragrunt run-all apply                                                                                                                                                                                                                  [9:25:59]
09:26:43.715 INFO   The stack at . will be processed in the following order for command apply:
Group 1
- Module ./interfaces


Are you sure you want to run 'terragrunt apply' in each folder of the stack described above? (y/n) y

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_interface.this will be created
  + resource "fortios_system_interface" "this" {
      + aggregate_type                             = (known after apply)
      + algorithm                                  = "L4"
      + allowaccess                                = "ping ssh https"
      + ap_discover                                = (known after apply)
      + arpforward                                 = (known after apply)
      + auth_type                                  = (known after apply)
      + auto_auth_extension_device                 = (known after apply)
      + autogenerated                              = (known after apply)
      + bfd                                        = (known after apply)
      + bfd_desired_min_tx                         = (known after apply)
      + bfd_detect_mult                            = (known after apply)
      + bfd_required_min_rx                        = (known after apply)
      + broadcast_forward                          = (known after apply)
      + dedicated_to                               = (known after apply)
      + default_purdue_level                       = (known after apply)
      + defaultgw                                  = "disable"
      + description                                = "Created by Terraform Provider for FortiOS"
      + detectprotocol                             = (known after apply)
      + device_identification                      = (known after apply)
      + device_user_identification                 = (known after apply)
      + devindex                                   = (known after apply)
      + dhcp_broadcast_flag                        = (known after apply)
      + dhcp_classless_route_addition              = (known after apply)
      + dhcp_relay_agent_option                    = (known after apply)
      + dhcp_relay_allow_no_end_option             = (known after apply)
      + dhcp_relay_interface_select_method         = (known after apply)
      + dhcp_relay_link_selection                  = (known after apply)
      + dhcp_relay_request_all_server              = (known after apply)
      + dhcp_relay_service                         = (known after apply)
      + dhcp_relay_source_ip                       = (known after apply)
      + dhcp_relay_type                            = (known after apply)
      + dhcp_relay_vrf_select                      = (known after apply)
      + dhcp_smart_relay                           = (known after apply)
      + disc_retry_timeout                         = (known after apply)
      + distance                                   = 5
      + dns_server_override                        = (known after apply)
      + dns_server_protocol                        = (known after apply)
      + drop_fragment                              = (known after apply)
      + drop_overlapped_fragment                   = (known after apply)
      + dynamic_sort_subtable                      = "alphabetical"
      + eap_supplicant                             = (known after apply)
      + explicit_ftp_proxy                         = (known after apply)
      + explicit_web_proxy                         = (known after apply)
      + external                                   = (known after apply)
      + fail_action_on_extender                    = (known after apply)
      + fail_alert_method                          = (known after apply)
      + fail_detect                                = (known after apply)
      + fail_detect_option                         = (known after apply)
      + fortilink                                  = (known after apply)
      + fortilink_neighbor_detect                  = (known after apply)
      + fortilink_split_interface                  = (known after apply)
      + fortilink_stacking                         = (known after apply)
      + forward_error_correction                   = (known after apply)
      + get_all_tables                             = "false"
      + gwdetect                                   = (known after apply)
      + ha_priority                                = (known after apply)
      + icmp_accept_redirect                       = (known after apply)
      + icmp_send_redirect                         = (known after apply)
      + id                                         = (known after apply)
      + ident_accept                               = (known after apply)
      + interface                                  = (known after apply)
      + ip                                         = "10.20.30.40 255.255.255.0"
      + ip_managed_by_fortiipam                    = (known after apply)
      + ipmac                                      = (known after apply)
      + ips_sniffer_mode                           = (known after apply)
      + ipunnumbered                               = (known after apply)
      + l2forward                                  = (known after apply)
      + lacp_ha_secondary                          = (known after apply)
      + lacp_ha_slave                              = (known after apply)
      + lacp_mode                                  = (known after apply)
      + lacp_speed                                 = (known after apply)
      + lcp_echo_interval                          = (known after apply)
      + lcp_max_echo_fails                         = (known after apply)
      + link_up_delay                              = (known after apply)
      + lldp_reception                             = (known after apply)
      + lldp_transmission                          = (known after apply)
      + macaddr                                    = (known after apply)
      + managed_subnetwork_size                    = (known after apply)
      + management_ip                              = (known after apply)
      + mediatype                                  = (known after apply)
      + min_links                                  = (known after apply)
      + min_links_down                             = (known after apply)
      + mode                                       = "static"
      + monitor_bandwidth                          = (known after apply)
      + mtu                                        = 1500
      + mtu_override                               = "disable"
      + name                                       = "internal4"
      + ndiscforward                               = (known after apply)
      + netbios_forward                            = (known after apply)
      + netflow_sample_rate                        = (known after apply)
      + netflow_sampler                            = (known after apply)
      + padt_retry_timeout                         = (known after apply)
      + polling_interval                           = (known after apply)
      + pppoe_egress_cos                           = (known after apply)
      + pppoe_unnumbered_negotiate                 = (known after apply)
      + pptp_auth_type                             = (known after apply)
      + pptp_client                                = (known after apply)
      + pptp_server_ip                             = (known after apply)
      + preserve_session_route                     = (known after apply)
      + priority                                   = (known after apply)
      + priority_override                          = (known after apply)
      + proxy_captive_portal                       = (known after apply)
      + reachable_time                             = (known after apply)
      + remote_ip                                  = (known after apply)
      + role                                       = (known after apply)
      + sample_direction                           = (known after apply)
      + sample_rate                                = (known after apply)
      + secondary_ip                               = (known after apply)
      + security_ip_auth_bypass                    = (known after apply)
      + security_mac_auth_bypass                   = (known after apply)
      + security_mode                              = (known after apply)
      + sflow_sampler                              = (known after apply)
      + snmp_index                                 = (known after apply)
      + speed                                      = (known after apply)
      + src_check                                  = (known after apply)
      + status                                     = (known after apply)
      + stp                                        = (known after apply)
      + stp_ha_secondary                           = (known after apply)
      + stpforward                                 = (known after apply)
      + stpforward_mode                            = (known after apply)
      + subst                                      = (known after apply)
      + substitute_dst_mac                         = (known after apply)
      + switch_controller_access_vlan              = (known after apply)
      + switch_controller_arp_inspection           = (known after apply)
      + switch_controller_dhcp_snooping            = (known after apply)
      + switch_controller_dhcp_snooping_option82   = (known after apply)
      + switch_controller_dhcp_snooping_verify_mac = (known after apply)
      + switch_controller_feature                  = (known after apply)
      + switch_controller_igmp_snooping            = (known after apply)
      + switch_controller_igmp_snooping_fast_leave = (known after apply)
      + switch_controller_igmp_snooping_proxy      = (known after apply)
      + switch_controller_iot_scanning             = (known after apply)
      + switch_controller_mgmt_vlan                = (known after apply)
      + switch_controller_netflow_collect          = (known after apply)
      + switch_controller_offload                  = (known after apply)
      + switch_controller_offload_gw               = (known after apply)
      + switch_controller_offload_ip               = (known after apply)
      + switch_controller_rspan_mode               = (known after apply)
      + switch_controller_source_ip                = (known after apply)
      + system_id                                  = (known after apply)
      + system_id_type                             = (known after apply)
      + trunk                                      = (known after apply)
      + trust_ip6_1                                = (known after apply)
      + trust_ip6_2                                = (known after apply)
      + trust_ip6_3                                = (known after apply)
      + trust_ip_1                                 = (known after apply)
      + trust_ip_2                                 = (known after apply)
      + trust_ip_3                                 = (known after apply)
      + type                                       = "physical"
      + vdom                                       = "root"
      + vdomparam                                  = (known after apply)
      + virtual_mac                                = (known after apply)
      + vlan_protocol                              = (known after apply)
      + vlanforward                                = (known after apply)
      + vrrp_virtual_mac                           = (known after apply)
      + wccp                                       = (known after apply)
      + wins_ip                                    = (known after apply)

      + ipv6 (known after apply)

      + phy_setting (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id   = (known after apply)
  + ip   = "10.20.30.40 255.255.255.0"
  + type = "physical"
fortios_system_interface.this: Creating...
fortios_system_interface.this: Creation complete after 0s [id=internal4]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

id = "internal4"
ip = "10.20.30.40 255.255.255.0"
type = "physical"
```

### Step-3
```
cph-fw-01 # show system interface internal4
config system interface
    edit "internal4"
        set vdom "root"
        set ip 10.20.30.40 255.255.255.0
        set allowaccess ping https ssh
        set type physical
        set description "Created by Terraform Provider for FortiOS"
        set snmp-index 11
    next
end
```

### Step-4
```
$ terragrunt run-all destroy                                                                                                                                                                                                                [9:28:36]
09:28:43.026 INFO   The stack at . will be processed in the following order for command destroy:
Group 1
- Module ./interfaces


WARNING: Are you sure you want to run `terragrunt destroy` in each folder of the stack described above? There is no undo! (y/n) y
fortios_system_interface.this: Refreshing state... [id=internal4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # fortios_system_interface.this will be destroyed
  - resource "fortios_system_interface" "this" {
      - aggregate_type                             = "physical" -> null
      - algorithm                                  = "L4" -> null
      - allowaccess                                = "ping https ssh" -> null
      - ap_discover                                = "enable" -> null
      - arpforward                                 = "enable" -> null
      - auth_type                                  = "auto" -> null
      - auto_auth_extension_device                 = "disable" -> null
      - bandwidth_measure_time                     = 0 -> null
      - bfd                                        = "global" -> null
      - bfd_desired_min_tx                         = 250 -> null
      - bfd_detect_mult                            = 3 -> null
      - bfd_required_min_rx                        = 250 -> null
      - broadcast_forward                          = "disable" -> null
      - captive_portal                             = 0 -> null
      - cli_conn_status                            = 0 -> null
      - color                                      = 0 -> null
      - dedicated_to                               = "none" -> null
      - default_purdue_level                       = "3" -> null
      - defaultgw                                  = "enable" -> null
      - description                                = "Created by Terraform Provider for FortiOS" -> null
      - detected_peer_mtu                          = 0 -> null
      - detectprotocol                             = "ping" -> null
      - device_identification                      = "disable" -> null
      - device_user_identification                 = "enable" -> null
      - devindex                                   = 11 -> null
      - dhcp_broadcast_flag                        = "enable" -> null
      - dhcp_classless_route_addition              = "disable" -> null
      - dhcp_relay_agent_option                    = "enable" -> null
      - dhcp_relay_allow_no_end_option             = "disable" -> null
      - dhcp_relay_interface_select_method         = "auto" -> null
      - dhcp_relay_link_selection                  = "0.0.0.0" -> null
      - dhcp_relay_request_all_server              = "disable" -> null
      - dhcp_relay_service                         = "disable" -> null
      - dhcp_relay_source_ip                       = "0.0.0.0" -> null
      - dhcp_relay_type                            = "regular" -> null
      - dhcp_relay_vrf_select                      = -1 -> null
      - dhcp_renew_time                            = 0 -> null
      - dhcp_smart_relay                           = "disable" -> null
      - disc_retry_timeout                         = 1 -> null
      - disconnect_threshold                       = 0 -> null
      - distance                                   = 5 -> null
      - dns_server_override                        = "enable" -> null
      - dns_server_protocol                        = "cleartext" -> null
      - drop_fragment                              = "disable" -> null
      - drop_overlapped_fragment                   = "disable" -> null
      - dynamic_sort_subtable                      = "alphabetical" -> null
      - eap_supplicant                             = "disable" -> null
      - estimated_downstream_bandwidth             = 0 -> null
      - estimated_upstream_bandwidth               = 0 -> null
      - explicit_ftp_proxy                         = "disable" -> null
      - explicit_web_proxy                         = "disable" -> null
      - external                                   = "disable" -> null
      - fail_action_on_extender                    = "soft-restart" -> null
      - fail_alert_method                          = "link-down" -> null
      - fail_detect                                = "disable" -> null
      - fail_detect_option                         = "link-down" -> null
      - fortilink                                  = "disable" -> null
      - fortilink_backup_link                      = 0 -> null
      - fortilink_neighbor_detect                  = "lldp" -> null
      - fortilink_split_interface                  = "enable" -> null
      - forward_domain                             = 0 -> null
      - get_all_tables                             = "false" -> null
      - gwdetect                                   = "disable" -> null
      - ha_priority                                = 1 -> null
      - icmp_accept_redirect                       = "enable" -> null
      - icmp_send_redirect                         = "enable" -> null
      - id                                         = "internal4" -> null
      - ident_accept                               = "disable" -> null
      - idle_timeout                               = 0 -> null
      - inbandwidth                                = 0 -> null
      - ingress_spillover_threshold                = 0 -> null
      - internal                                   = 0 -> null
      - ip                                         = "10.20.30.40 255.255.255.0" -> null
      - ip_managed_by_fortiipam                    = "inherit-global" -> null
      - ipmac                                      = "disable" -> null
      - ips_sniffer_mode                           = "disable" -> null
      - ipunnumbered                               = "0.0.0.0" -> null
      - l2forward                                  = "disable" -> null
      - lacp_ha_secondary                          = "enable" -> null
      - lacp_mode                                  = "active" -> null
      - lacp_speed                                 = "slow" -> null
      - lcp_echo_interval                          = 5 -> null
      - lcp_max_echo_fails                         = 3 -> null
      - link_up_delay                              = 50 -> null
      - lldp_reception                             = "vdom" -> null
      - lldp_transmission                          = "vdom" -> null
      - managed_subnetwork_size                    = "256" -> null
      - management_ip                              = "0.0.0.0 0.0.0.0" -> null
      - measured_downstream_bandwidth              = 0 -> null
      - measured_upstream_bandwidth                = 0 -> null
      - min_links                                  = 1 -> null
      - min_links_down                             = "operational" -> null
      - mode                                       = "static" -> null
      - monitor_bandwidth                          = "disable" -> null
      - mtu                                        = 1500 -> null
      - mtu_override                               = "disable" -> null
      - name                                       = "internal4" -> null
      - ndiscforward                               = "enable" -> null
      - netbios_forward                            = "disable" -> null
      - netflow_sample_rate                        = 1 -> null
      - netflow_sampler                            = "disable" -> null
      - netflow_sampler_id                         = 0 -> null
      - outbandwidth                               = 0 -> null
      - padt_retry_timeout                         = 1 -> null
      - ping_serv_status                           = 0 -> null
      - polling_interval                           = 20 -> null
      - pppoe_egress_cos                           = "cos0" -> null
      - pppoe_unnumbered_negotiate                 = "enable" -> null
      - pptp_auth_type                             = "auto" -> null
      - pptp_client                                = "disable" -> null
      - pptp_server_ip                             = "0.0.0.0" -> null
      - pptp_timeout                               = 0 -> null
      - preserve_session_route                     = "disable" -> null
      - priority                                   = 1 -> null
      - priority_override                          = "enable" -> null
      - proxy_captive_portal                       = "disable" -> null
      - reachable_time                             = 30000 -> null
      - remote_ip                                  = "0.0.0.0 0.0.0.0" -> null
      - ring_rx                                    = 0 -> null
      - ring_tx                                    = 0 -> null
      - role                                       = "undefined" -> null
      - sample_direction                           = "both" -> null
      - sample_rate                                = 2000 -> null
      - secondary_ip                               = "disable" -> null
      - security_ip_auth_bypass                    = "disable" -> null
      - security_mac_auth_bypass                   = "disable" -> null
      - security_mode                              = "none" -> null
      - sflow_sampler                              = "disable" -> null
      - snmp_index                                 = 11 -> null
      - speed                                      = "auto" -> null
      - spillover_threshold                        = 0 -> null
      - src_check                                  = "enable" -> null
      - status                                     = "up" -> null
      - stp                                        = "disable" -> null
      - stp_ha_secondary                           = "priority-adjust" -> null
      - stpforward                                 = "disable" -> null
      - stpforward_mode                            = "rpl-all-ext-id" -> null
      - subst                                      = "disable" -> null
      - substitute_dst_mac                         = "00:00:00:00:00:00" -> null
      - swc_first_create                           = 0 -> null
      - swc_vlan                                   = 0 -> null
      - switch_controller_access_vlan              = "disable" -> null
      - switch_controller_arp_inspection           = "disable" -> null
      - switch_controller_dhcp_snooping            = "disable" -> null
      - switch_controller_dhcp_snooping_option82   = "disable" -> null
      - switch_controller_dhcp_snooping_verify_mac = "disable" -> null
      - switch_controller_feature                  = "none" -> null
      - switch_controller_igmp_snooping            = "disable" -> null
      - switch_controller_igmp_snooping_fast_leave = "disable" -> null
      - switch_controller_igmp_snooping_proxy      = "disable" -> null
      - switch_controller_iot_scanning             = "disable" -> null
      - switch_controller_learning_limit           = 0 -> null
      - switch_controller_mgmt_vlan                = 4094 -> null
      - switch_controller_netflow_collect          = "disable" -> null
      - switch_controller_offload                  = "disable" -> null
      - switch_controller_offload_gw               = "disable" -> null
      - switch_controller_offload_ip               = "0.0.0.0" -> null
      - switch_controller_rspan_mode               = "disable" -> null
      - switch_controller_source_ip                = "outbound" -> null
      - system_id                                  = "00:00:00:00:00:00" -> null
      - system_id_type                             = "auto" -> null
      - tcp_mss                                    = 0 -> null
      - trunk                                      = "disable" -> null
      - trust_ip6_1                                = "::/0" -> null
      - trust_ip6_2                                = "::/0" -> null
      - trust_ip6_3                                = "::/0" -> null
      - trust_ip_1                                 = "0.0.0.0 0.0.0.0" -> null
      - trust_ip_2                                 = "0.0.0.0 0.0.0.0" -> null
      - trust_ip_3                                 = "0.0.0.0 0.0.0.0" -> null
      - type                                       = "physical" -> null
      - vdom                                       = "root" -> null
      - vindex                                     = 0 -> null
      - virtual_mac                                = "00:00:00:00:00:00" -> null
      - vlan_protocol                              = "8021q" -> null
      - vlanforward                                = "disable" -> null
      - vlanid                                     = 0 -> null
      - vrf                                        = 0 -> null
      - vrrp_virtual_mac                           = "disable" -> null
      - wccp                                       = "disable" -> null
      - weight                                     = 0 -> null
      - wins_ip                                    = "0.0.0.0" -> null
        # (45 unchanged attributes hidden)
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - id   = "internal4" -> null
  - ip   = "10.20.30.40 255.255.255.0" -> null
  - type = "physical" -> null
fortios_system_interface.this: Destroying... [id=internal4]
fortios_system_interface.this: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.
```

### Step-6
```
$ terragrunt run-all plan                                                                                                                                                                                                                   [9:30:25]
09:30:48.499 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./interfaces


09:30:48.558 INFO   [interfaces] Downloading Terraform configurations from .. into ./interfaces/.terragrunt-cache/oOdDw1KPUM6iSR3MeNL49dLsVJs/92QTYUsiYl120VgdqFSJPW_tTkA
Initializing the backend...
Initializing provider plugins...
- Reusing previous version of fortinetdev/fortios from the dependency lock file
- Using previously-installed fortinetdev/fortios v1.22.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
fortios_system_interface.this: Refreshing state... [id=internal4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # fortios_system_interface.this must be replaced
-/+ resource "fortios_system_interface" "this" {
      ~ aggregate_type                             = "physical" -> (known after apply)
      ~ allowaccess                                = "ping https ssh" -> "ping ssh https"
      ~ ap_discover                                = "enable" -> (known after apply)
      ~ arpforward                                 = "enable" -> (known after apply)
      ~ auth_type                                  = "auto" -> (known after apply)
      ~ auto_auth_extension_device                 = "disable" -> (known after apply)
      + autogenerated                              = (known after apply)
      - bandwidth_measure_time                     = 0 -> null
      ~ bfd                                        = "global" -> (known after apply)
      ~ bfd_desired_min_tx                         = 250 -> (known after apply)
      ~ bfd_detect_mult                            = 3 -> (known after apply)
      ~ bfd_required_min_rx                        = 250 -> (known after apply)
      ~ broadcast_forward                          = "disable" -> (known after apply)
      - captive_portal                             = 0 -> null
      - cli_conn_status                            = 0 -> null
      - color                                      = 0 -> null
      ~ dedicated_to                               = "none" -> (known after apply)
      ~ default_purdue_level                       = "3" -> (known after apply)
      ~ defaultgw                                  = "enable" -> "disable"
      - detected_peer_mtu                          = 0 -> null
      ~ detectprotocol                             = "ping" -> (known after apply)
      ~ device_identification                      = "disable" -> (known after apply)
      ~ device_user_identification                 = "enable" -> (known after apply)
      ~ devindex                                   = 11 -> (known after apply)
      ~ dhcp_broadcast_flag                        = "enable" -> (known after apply)
      ~ dhcp_classless_route_addition              = "disable" -> (known after apply)
      ~ dhcp_relay_agent_option                    = "enable" -> (known after apply)
      ~ dhcp_relay_allow_no_end_option             = "disable" -> (known after apply)
      ~ dhcp_relay_interface_select_method         = "auto" -> (known after apply)
      ~ dhcp_relay_link_selection                  = "0.0.0.0" -> (known after apply)
      ~ dhcp_relay_request_all_server              = "disable" -> (known after apply)
      ~ dhcp_relay_service                         = "disable" -> (known after apply)
      ~ dhcp_relay_source_ip                       = "0.0.0.0" -> (known after apply)
      ~ dhcp_relay_type                            = "regular" -> (known after apply)
      ~ dhcp_relay_vrf_select                      = -1 -> (known after apply)
      - dhcp_renew_time                            = 0 -> null
      ~ dhcp_smart_relay                           = "disable" -> (known after apply)
      ~ disc_retry_timeout                         = 1 -> (known after apply)
      - disconnect_threshold                       = 0 -> null
      ~ dns_server_override                        = "enable" -> (known after apply)
      ~ dns_server_protocol                        = "cleartext" -> (known after apply)
      ~ drop_fragment                              = "disable" -> (known after apply)
      ~ drop_overlapped_fragment                   = "disable" -> (known after apply)
      ~ eap_supplicant                             = "disable" -> (known after apply)
      - estimated_downstream_bandwidth             = 0 -> null
      - estimated_upstream_bandwidth               = 0 -> null
      ~ explicit_ftp_proxy                         = "disable" -> (known after apply)
      ~ explicit_web_proxy                         = "disable" -> (known after apply)
      ~ external                                   = "disable" -> (known after apply)
      ~ fail_action_on_extender                    = "soft-restart" -> (known after apply)
      ~ fail_alert_method                          = "link-down" -> (known after apply)
      ~ fail_detect                                = "disable" -> (known after apply)
      ~ fail_detect_option                         = "link-down" -> (known after apply)
      ~ fortilink                                  = "disable" -> (known after apply)
      - fortilink_backup_link                      = 0 -> null
      ~ fortilink_neighbor_detect                  = "lldp" -> (known after apply)
      ~ fortilink_split_interface                  = "enable" -> (known after apply)
      + fortilink_stacking                         = (known after apply)
      - forward_domain                             = 0 -> null
      + forward_error_correction                   = (known after apply)
      ~ gwdetect                                   = "disable" -> (known after apply)
      ~ ha_priority                                = 1 -> (known after apply)
      ~ icmp_accept_redirect                       = "enable" -> (known after apply)
      ~ icmp_send_redirect                         = "enable" -> (known after apply)
      ~ id                                         = "internal4" -> (known after apply)
      ~ ident_accept                               = "disable" -> (known after apply)
      - idle_timeout                               = 0 -> null
      - inbandwidth                                = 0 -> null
      - ingress_spillover_threshold                = 0 -> null
      + interface                                  = (known after apply)
      - internal                                   = 0 -> null
      ~ ip_managed_by_fortiipam                    = "inherit-global" -> (known after apply)
      ~ ipmac                                      = "disable" -> (known after apply)
      ~ ips_sniffer_mode                           = "disable" -> (known after apply)
      ~ ipunnumbered                               = "0.0.0.0" -> (known after apply)
      ~ l2forward                                  = "disable" -> (known after apply)
      ~ lacp_ha_secondary                          = "enable" -> (known after apply)
      + lacp_ha_slave                              = (known after apply)
      ~ lacp_mode                                  = "active" -> (known after apply)
      ~ lacp_speed                                 = "slow" -> (known after apply)
      ~ lcp_echo_interval                          = 5 -> (known after apply)
      ~ lcp_max_echo_fails                         = 3 -> (known after apply)
      ~ link_up_delay                              = 50 -> (known after apply)
      ~ lldp_reception                             = "vdom" -> (known after apply)
      ~ lldp_transmission                          = "vdom" -> (known after apply)
      + macaddr                                    = (known after apply)
      ~ managed_subnetwork_size                    = "256" -> (known after apply)
      ~ management_ip                              = "0.0.0.0 0.0.0.0" -> (known after apply)
      - measured_downstream_bandwidth              = 0 -> null
      - measured_upstream_bandwidth                = 0 -> null
      + mediatype                                  = (known after apply)
      ~ min_links                                  = 1 -> (known after apply)
      ~ min_links_down                             = "operational" -> (known after apply)
      ~ monitor_bandwidth                          = "disable" -> (known after apply)
      ~ name                                       = "internal4" -> "internal5" # forces replacement
      ~ ndiscforward                               = "enable" -> (known after apply)
      ~ netbios_forward                            = "disable" -> (known after apply)
      ~ netflow_sample_rate                        = 1 -> (known after apply)
      ~ netflow_sampler                            = "disable" -> (known after apply)
      - netflow_sampler_id                         = 0 -> null
      - outbandwidth                               = 0 -> null
      ~ padt_retry_timeout                         = 1 -> (known after apply)
      - ping_serv_status                           = 0 -> null
      ~ polling_interval                           = 20 -> (known after apply)
      ~ pppoe_egress_cos                           = "cos0" -> (known after apply)
      ~ pppoe_unnumbered_negotiate                 = "enable" -> (known after apply)
      ~ pptp_auth_type                             = "auto" -> (known after apply)
      ~ pptp_client                                = "disable" -> (known after apply)
      ~ pptp_server_ip                             = "0.0.0.0" -> (known after apply)
      - pptp_timeout                               = 0 -> null
      ~ preserve_session_route                     = "disable" -> (known after apply)
      ~ priority                                   = 1 -> (known after apply)
      ~ priority_override                          = "enable" -> (known after apply)
      ~ proxy_captive_portal                       = "disable" -> (known after apply)
      ~ reachable_time                             = 30000 -> (known after apply)
      ~ remote_ip                                  = "0.0.0.0 0.0.0.0" -> (known after apply)
      - ring_rx                                    = 0 -> null
      - ring_tx                                    = 0 -> null
      ~ role                                       = "undefined" -> (known after apply)
      ~ sample_direction                           = "both" -> (known after apply)
      ~ sample_rate                                = 2000 -> (known after apply)
      ~ secondary_ip                               = "disable" -> (known after apply)
      ~ security_ip_auth_bypass                    = "disable" -> (known after apply)
      ~ security_mac_auth_bypass                   = "disable" -> (known after apply)
      ~ security_mode                              = "none" -> (known after apply)
      ~ sflow_sampler                              = "disable" -> (known after apply)
      ~ snmp_index                                 = 11 -> (known after apply)
      ~ speed                                      = "auto" -> (known after apply)
      - spillover_threshold                        = 0 -> null
      ~ src_check                                  = "enable" -> (known after apply)
      ~ status                                     = "up" -> (known after apply)
      ~ stp                                        = "disable" -> (known after apply)
      ~ stp_ha_secondary                           = "priority-adjust" -> (known after apply)
      ~ stpforward                                 = "disable" -> (known after apply)
      ~ stpforward_mode                            = "rpl-all-ext-id" -> (known after apply)
      ~ subst                                      = "disable" -> (known after apply)
      ~ substitute_dst_mac                         = "00:00:00:00:00:00" -> (known after apply)
      - swc_first_create                           = 0 -> null
      - swc_vlan                                   = 0 -> null
      ~ switch_controller_access_vlan              = "disable" -> (known after apply)
      ~ switch_controller_arp_inspection           = "disable" -> (known after apply)
      ~ switch_controller_dhcp_snooping            = "disable" -> (known after apply)
      ~ switch_controller_dhcp_snooping_option82   = "disable" -> (known after apply)
      ~ switch_controller_dhcp_snooping_verify_mac = "disable" -> (known after apply)
      ~ switch_controller_feature                  = "none" -> (known after apply)
      ~ switch_controller_igmp_snooping            = "disable" -> (known after apply)
      ~ switch_controller_igmp_snooping_fast_leave = "disable" -> (known after apply)
      ~ switch_controller_igmp_snooping_proxy      = "disable" -> (known after apply)
      ~ switch_controller_iot_scanning             = "disable" -> (known after apply)
      - switch_controller_learning_limit           = 0 -> null
      ~ switch_controller_mgmt_vlan                = 4094 -> (known after apply)
      ~ switch_controller_netflow_collect          = "disable" -> (known after apply)
      ~ switch_controller_offload                  = "disable" -> (known after apply)
      ~ switch_controller_offload_gw               = "disable" -> (known after apply)
      ~ switch_controller_offload_ip               = "0.0.0.0" -> (known after apply)
      ~ switch_controller_rspan_mode               = "disable" -> (known after apply)
      ~ switch_controller_source_ip                = "outbound" -> (known after apply)
      ~ system_id                                  = "00:00:00:00:00:00" -> (known after apply)
      ~ system_id_type                             = "auto" -> (known after apply)
      - tcp_mss                                    = 0 -> null
      ~ trunk                                      = "disable" -> (known after apply)
      ~ trust_ip6_1                                = "::/0" -> (known after apply)
      ~ trust_ip6_2                                = "::/0" -> (known after apply)
      ~ trust_ip6_3                                = "::/0" -> (known after apply)
      ~ trust_ip_1                                 = "0.0.0.0 0.0.0.0" -> (known after apply)
      ~ trust_ip_2                                 = "0.0.0.0 0.0.0.0" -> (known after apply)
      ~ trust_ip_3                                 = "0.0.0.0 0.0.0.0" -> (known after apply)
      + vdomparam                                  = (known after apply)
      - vindex                                     = 0 -> null
      ~ virtual_mac                                = "00:00:00:00:00:00" -> (known after apply)
      ~ vlan_protocol                              = "8021q" -> (known after apply)
      ~ vlanforward                                = "disable" -> (known after apply)
      - vlanid                                     = 0 -> null
      - vrf                                        = 0 -> null
      ~ vrrp_virtual_mac                           = "disable" -> (known after apply)
      ~ wccp                                       = "disable" -> (known after apply)
      - weight                                     = 0 -> null
      ~ wins_ip                                    = "0.0.0.0" -> (known after apply)
        # (50 unchanged attributes hidden)

      ~ ipv6 (known after apply)

      ~ phy_setting (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ id   = "internal4" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

### Step-7
```
$ terragrunt run-all apply                                                                                                                                                                                                                  [9:33:48]
09:33:54.075 INFO   The stack at . will be processed in the following order for command apply:
Group 1
- Module ./interfaces


Are you sure you want to run 'terragrunt apply' in each folder of the stack described above? (y/n) y
╷
│ Error: Error creating SystemInterface resource: Internal Server Error - Internal error when processing the request (500)
│ Cli response: 
│ [Subnets overlap between 'internal5' with primary IP of 'internal4' node_check_object fail! for ip 10.20.30.40 255.255.255.0 value parse error before '255.255.255.0' Command fail. Return code -54]
│ 
│   with fortios_system_interface.this,
│   on main.tf line 1, in resource "fortios_system_interface" "this":
│    1: resource "fortios_system_interface" "this" {
│ 
╵
09:34:00.050 ERROR  [interfaces] terraform invocation failed in ./interfaces/.terragrunt-cache/oOdDw1KPUM6iSR3MeNL49dLsVJs/92QTYUsiYl120VgdqFSJPW_tTkA
fortios_system_interface.this: Refreshing state... [id=internal4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # fortios_system_interface.this must be replaced
-/+ resource "fortios_system_interface" "this" {
      ~ aggregate_type                             = "physical" -> (known after apply)
      ~ allowaccess                                = "ping https ssh" -> "ping ssh https"
      ~ ap_discover                                = "enable" -> (known after apply)
      ~ arpforward                                 = "enable" -> (known after apply)
      ~ auth_type                                  = "auto" -> (known after apply)
      ~ auto_auth_extension_device                 = "disable" -> (known after apply)
      + autogenerated                              = (known after apply)
      - bandwidth_measure_time                     = 0 -> null
      ~ bfd                                        = "global" -> (known after apply)
      ~ bfd_desired_min_tx                         = 250 -> (known after apply)
      ~ bfd_detect_mult                            = 3 -> (known after apply)
      ~ bfd_required_min_rx                        = 250 -> (known after apply)
      ~ broadcast_forward                          = "disable" -> (known after apply)
      - captive_portal                             = 0 -> null
      - cli_conn_status                            = 0 -> null
      - color                                      = 0 -> null
      ~ dedicated_to                               = "none" -> (known after apply)
      ~ default_purdue_level                       = "3" -> (known after apply)
      ~ defaultgw                                  = "enable" -> "disable"
      - detected_peer_mtu                          = 0 -> null
      ~ detectprotocol                             = "ping" -> (known after apply)
      ~ device_identification                      = "disable" -> (known after apply)
      ~ device_user_identification                 = "enable" -> (known after apply)
      ~ devindex                                   = 11 -> (known after apply)
      ~ dhcp_broadcast_flag                        = "enable" -> (known after apply)
      ~ dhcp_classless_route_addition              = "disable" -> (known after apply)
      ~ dhcp_relay_agent_option                    = "enable" -> (known after apply)
      ~ dhcp_relay_allow_no_end_option             = "disable" -> (known after apply)
      ~ dhcp_relay_interface_select_method         = "auto" -> (known after apply)
      ~ dhcp_relay_link_selection                  = "0.0.0.0" -> (known after apply)
      ~ dhcp_relay_request_all_server              = "disable" -> (known after apply)
      ~ dhcp_relay_service                         = "disable" -> (known after apply)
      ~ dhcp_relay_source_ip                       = "0.0.0.0" -> (known after apply)
      ~ dhcp_relay_type                            = "regular" -> (known after apply)
      ~ dhcp_relay_vrf_select                      = -1 -> (known after apply)
      - dhcp_renew_time                            = 0 -> null
      ~ dhcp_smart_relay                           = "disable" -> (known after apply)
      ~ disc_retry_timeout                         = 1 -> (known after apply)
      - disconnect_threshold                       = 0 -> null
      ~ dns_server_override                        = "enable" -> (known after apply)
      ~ dns_server_protocol                        = "cleartext" -> (known after apply)
      ~ drop_fragment                              = "disable" -> (known after apply)
      ~ drop_overlapped_fragment                   = "disable" -> (known after apply)
      ~ eap_supplicant                             = "disable" -> (known after apply)
      - estimated_downstream_bandwidth             = 0 -> null
      - estimated_upstream_bandwidth               = 0 -> null
      ~ explicit_ftp_proxy                         = "disable" -> (known after apply)
      ~ explicit_web_proxy                         = "disable" -> (known after apply)
      ~ external                                   = "disable" -> (known after apply)
      ~ fail_action_on_extender                    = "soft-restart" -> (known after apply)
      ~ fail_alert_method                          = "link-down" -> (known after apply)
      ~ fail_detect                                = "disable" -> (known after apply)
      ~ fail_detect_option                         = "link-down" -> (known after apply)
      ~ fortilink                                  = "disable" -> (known after apply)
      - fortilink_backup_link                      = 0 -> null
      ~ fortilink_neighbor_detect                  = "lldp" -> (known after apply)
      ~ fortilink_split_interface                  = "enable" -> (known after apply)
      + fortilink_stacking                         = (known after apply)
      - forward_domain                             = 0 -> null
      + forward_error_correction                   = (known after apply)
      ~ gwdetect                                   = "disable" -> (known after apply)
      ~ ha_priority                                = 1 -> (known after apply)
      ~ icmp_accept_redirect                       = "enable" -> (known after apply)
      ~ icmp_send_redirect                         = "enable" -> (known after apply)
      ~ id                                         = "internal4" -> (known after apply)
      ~ ident_accept                               = "disable" -> (known after apply)
      - idle_timeout                               = 0 -> null
      - inbandwidth                                = 0 -> null
      - ingress_spillover_threshold                = 0 -> null
      + interface                                  = (known after apply)
      - internal                                   = 0 -> null
      ~ ip_managed_by_fortiipam                    = "inherit-global" -> (known after apply)
      ~ ipmac                                      = "disable" -> (known after apply)
      ~ ips_sniffer_mode                           = "disable" -> (known after apply)
      ~ ipunnumbered                               = "0.0.0.0" -> (known after apply)
      ~ l2forward                                  = "disable" -> (known after apply)
      ~ lacp_ha_secondary                          = "enable" -> (known after apply)
      + lacp_ha_slave                              = (known after apply)
      ~ lacp_mode                                  = "active" -> (known after apply)
      ~ lacp_speed                                 = "slow" -> (known after apply)
      ~ lcp_echo_interval                          = 5 -> (known after apply)
      ~ lcp_max_echo_fails                         = 3 -> (known after apply)
      ~ link_up_delay                              = 50 -> (known after apply)
      ~ lldp_reception                             = "vdom" -> (known after apply)
      ~ lldp_transmission                          = "vdom" -> (known after apply)
      + macaddr                                    = (known after apply)
      ~ managed_subnetwork_size                    = "256" -> (known after apply)
      ~ management_ip                              = "0.0.0.0 0.0.0.0" -> (known after apply)
      - measured_downstream_bandwidth              = 0 -> null
      - measured_upstream_bandwidth                = 0 -> null
      + mediatype                                  = (known after apply)
      ~ min_links                                  = 1 -> (known after apply)
      ~ min_links_down                             = "operational" -> (known after apply)
      ~ monitor_bandwidth                          = "disable" -> (known after apply)
      ~ name                                       = "internal4" -> "internal5" # forces replacement
      ~ ndiscforward                               = "enable" -> (known after apply)
      ~ netbios_forward                            = "disable" -> (known after apply)
      ~ netflow_sample_rate                        = 1 -> (known after apply)
      ~ netflow_sampler                            = "disable" -> (known after apply)
      - netflow_sampler_id                         = 0 -> null
      - outbandwidth                               = 0 -> null
      ~ padt_retry_timeout                         = 1 -> (known after apply)
      - ping_serv_status                           = 0 -> null
      ~ polling_interval                           = 20 -> (known after apply)
      ~ pppoe_egress_cos                           = "cos0" -> (known after apply)
      ~ pppoe_unnumbered_negotiate                 = "enable" -> (known after apply)
      ~ pptp_auth_type                             = "auto" -> (known after apply)
      ~ pptp_client                                = "disable" -> (known after apply)
      ~ pptp_server_ip                             = "0.0.0.0" -> (known after apply)
      - pptp_timeout                               = 0 -> null
      ~ preserve_session_route                     = "disable" -> (known after apply)
      ~ priority                                   = 1 -> (known after apply)
      ~ priority_override                          = "enable" -> (known after apply)
      ~ proxy_captive_portal                       = "disable" -> (known after apply)
      ~ reachable_time                             = 30000 -> (known after apply)
      ~ remote_ip                                  = "0.0.0.0 0.0.0.0" -> (known after apply)
      - ring_rx                                    = 0 -> null
      - ring_tx                                    = 0 -> null
      ~ role                                       = "undefined" -> (known after apply)
      ~ sample_direction                           = "both" -> (known after apply)
      ~ sample_rate                                = 2000 -> (known after apply)
      ~ secondary_ip                               = "disable" -> (known after apply)
      ~ security_ip_auth_bypass                    = "disable" -> (known after apply)
      ~ security_mac_auth_bypass                   = "disable" -> (known after apply)
      ~ security_mode                              = "none" -> (known after apply)
      ~ sflow_sampler                              = "disable" -> (known after apply)
      ~ snmp_index                                 = 11 -> (known after apply)
      ~ speed                                      = "auto" -> (known after apply)
      - spillover_threshold                        = 0 -> null
      ~ src_check                                  = "enable" -> (known after apply)
      ~ status                                     = "up" -> (known after apply)
      ~ stp                                        = "disable" -> (known after apply)
      ~ stp_ha_secondary                           = "priority-adjust" -> (known after apply)
      ~ stpforward                                 = "disable" -> (known after apply)
      ~ stpforward_mode                            = "rpl-all-ext-id" -> (known after apply)
      ~ subst                                      = "disable" -> (known after apply)
      ~ substitute_dst_mac                         = "00:00:00:00:00:00" -> (known after apply)
      - swc_first_create                           = 0 -> null
      - swc_vlan                                   = 0 -> null
      ~ switch_controller_access_vlan              = "disable" -> (known after apply)
      ~ switch_controller_arp_inspection           = "disable" -> (known after apply)
      ~ switch_controller_dhcp_snooping            = "disable" -> (known after apply)
      ~ switch_controller_dhcp_snooping_option82   = "disable" -> (known after apply)
      ~ switch_controller_dhcp_snooping_verify_mac = "disable" -> (known after apply)
      ~ switch_controller_feature                  = "none" -> (known after apply)
      ~ switch_controller_igmp_snooping            = "disable" -> (known after apply)
      ~ switch_controller_igmp_snooping_fast_leave = "disable" -> (known after apply)
      ~ switch_controller_igmp_snooping_proxy      = "disable" -> (known after apply)
      ~ switch_controller_iot_scanning             = "disable" -> (known after apply)
      - switch_controller_learning_limit           = 0 -> null
      ~ switch_controller_mgmt_vlan                = 4094 -> (known after apply)
      ~ switch_controller_netflow_collect          = "disable" -> (known after apply)
      ~ switch_controller_offload                  = "disable" -> (known after apply)
      ~ switch_controller_offload_gw               = "disable" -> (known after apply)
      ~ switch_controller_offload_ip               = "0.0.0.0" -> (known after apply)
      ~ switch_controller_rspan_mode               = "disable" -> (known after apply)
      ~ switch_controller_source_ip                = "outbound" -> (known after apply)
      ~ system_id                                  = "00:00:00:00:00:00" -> (known after apply)
      ~ system_id_type                             = "auto" -> (known after apply)
      - tcp_mss                                    = 0 -> null
      ~ trunk                                      = "disable" -> (known after apply)
      ~ trust_ip6_1                                = "::/0" -> (known after apply)
      ~ trust_ip6_2                                = "::/0" -> (known after apply)
      ~ trust_ip6_3                                = "::/0" -> (known after apply)
      ~ trust_ip_1                                 = "0.0.0.0 0.0.0.0" -> (known after apply)
      ~ trust_ip_2                                 = "0.0.0.0 0.0.0.0" -> (known after apply)
      ~ trust_ip_3                                 = "0.0.0.0 0.0.0.0" -> (known after apply)
      + vdomparam                                  = (known after apply)
      - vindex                                     = 0 -> null
      ~ virtual_mac                                = "00:00:00:00:00:00" -> (known after apply)
      ~ vlan_protocol                              = "8021q" -> (known after apply)
      ~ vlanforward                                = "disable" -> (known after apply)
      - vlanid                                     = 0 -> null
      - vrf                                        = 0 -> null
      ~ vrrp_virtual_mac                           = "disable" -> (known after apply)
      ~ wccp                                       = "disable" -> (known after apply)
      - weight                                     = 0 -> null
      ~ wins_ip                                    = "0.0.0.0" -> (known after apply)
        # (50 unchanged attributes hidden)

      ~ ipv6 (known after apply)

      ~ phy_setting (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ id   = "internal4" -> (known after apply)
fortios_system_interface.this: Destroying... [id=internal4]
fortios_system_interface.this: Destruction complete after 0s
fortios_system_interface.this: Creating...
09:34:00.050 ERROR  [interfaces] Module ./interfaces has finished with an error
09:34:00.051 ERROR  error occurred:

* Failed to execute "terraform apply -auto-approve -input=false" in ./interfaces/.terragrunt-cache/oOdDw1KPUM6iSR3MeNL49dLsVJs/92QTYUsiYl120VgdqFSJPW_tTkA
  ╷
  │ Error: Error creating SystemInterface resource: Internal Server Error - Internal error when processing the request (500)
  │ Cli response: 
  │ [Subnets overlap between 'internal5' with primary IP of 'internal4' node_check_object fail! for ip 10.20.30.40 255.255.255.0 value parse error before '255.255.255.0' Command fail. Return code -54]
  │ 
  │   with fortios_system_interface.this,
  │   on main.tf line 1, in resource "fortios_system_interface" "this":
  │    1: resource "fortios_system_interface" "this" {
  │ 
  ╵
  
  exit status 1
```

### Step-8
```
cph-fw-01 (internal4) # unset ip 

cph-fw-01 (internal4) # unset allowaccess 

cph-fw-01 (internal4) # unset description 

cph-fw-01 (internal4) # end

cph-fw-01 # show system interface internal4
config system interface
    edit "internal4"
        set vdom "root"
        set type physical
        set snmp-index 11
    next
end
```



